data_generation/simulation_results/openfoam/case_8/constant/simParams
nIter 2000;
hComponent0 954.8105884511306;
hComponent1 1109.3351191401302;
hComponent2 1088.2594267579602;
hComponent3 657.2652361114958;
hComponent4 1293.052598541757;kComponent0 54.20352310663587;
kComponent1 83.99562707324777;
kComponent2 31.74695117432102;
kComponent3 20.749311640912346;
kComponent4 16.860707224706854;
tAmbient 300;
Ux 2.5767587678662833;
kPCB 0.417217101768975;