data_generation/simulation_results/openfoam/case_8/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver           PBiCGStab;
        preconditioner   DIC;
        tolerance        1e-5;
        relTol           0.1;
        smoother         GaussSeidel;
        cacheAgglomeration true;
    }


   "(U|k|h|epsilon|)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0.05;
    }
}

SIMPLE
{
    momentumPredictor true;
    nNonOrthogonalCorrectors 0;
    frozenFlow      false;

    residualControl
    {
        default         1e-7;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.1;
	p		0.1;
        rho             0.5;
	T		0.9;
	U		0.4;
    }

    equations
    {
        rho             0.4;
        U               0.7;
        "(h|e).*"       0.7;
        k               0.7;
        epsilon         0.7;
    }
}

// ************************************************************************* //
